Map<String, dynamic> baseHoraData = {
  "wood": {
    "Yang Wood": {
      "pros":
          "เป็นคนที่ชอบเรียนรู้อย่างไม่มีที่สิ้นสุด รักความก้าวหน้า มีเมตตา ชอบช่วยเหลือคนรอบข้าง ใจบุญ มั่นคง ซื่อสัตย์ รักใครรักจริง รักสงบ เชื่อมั่นในตัวเองสูง",
      "cons": "ดื้อและขี้ระแวง เป็นคนแข็งทื่อ",
    },
    "Yin Wood": {
      "pros":
          "ชอบพัฒนา รักความก้าวหน้า มีเมตตา รักสงบ นิสัยนุ่มนวล อ่อนโยน ยืดหยุ่น ปรับตัวเก่ง มีทักษะในการแสดงออกที่ดี มีไหวพริบ",
      "cons": "ขี้น้อยใจ คิดเล็กคิดน้อย อิจฉา บางครั้งมองผลประโยชน์ตัวเองก่อน"
    },
    "occupation":
        "งานที่เกี่ยวกับการเติบโตก้าวหน้ารวมถึงการให้คำปรึกษาและแนะนำ เช่น ครู, นักพัฒนา"
  },
  "fire": {
    "Yang Fire": {
      "pros":
          "ชอบความโดดเด่นมีชื่อเสียง ใครร้ายใส่จะจำขึ้นใจนาน ใครยกยอจะรักใคร่ มารยาทดี ซื่อสัตย์ ชอบคนแสดงออกใจกว้าง รักพวกพ้อง กระตือรือร้น ชอบทำกิจวัตรเดิมซ้ำๆ",
      "cons": "ชอบคิดว่าความคิดตัวเองเป็นใหญ่ โกรธง่ายหายเร็ว เสียหน้าไม่ได้",
    },
    "Yin Fire": {
      "pros":
          "นิสัยอบอุ่น มีมารยาท มีน้ำใจ เสียสละเพื่อคนอื่น ดูแลผู้อื่นมากกว่าตัวเอง มีความเป็นผู้นำ ชี้นำคน หาโอกาสเก่ง เข้าใจจิตใจคนอื่นได้ดี พิถีพิถันรอบคอบและระมัดระวัง โกรธง่ายหายเร็ว",
      "cons": "อารมณ์อ่อนไหวเปลี่ยนแปลงไปมาได้ ขี้ระแวง",
    },
    "occupation":
        "งานบริการ, งาน IT, งานเกี่ยวกับการสื่อสาร, หมอแผนปัจจุบัน, งานที่ขึ้นกับความร้อนหรือแสง เช่น ถ่ายภาพ, ผลิตภาพยนตร์",
  },
  "earth": {
    "Yang Earth": {
      "pros":
          "เป็นคนมั่นคง สุขุม หนักแน่น กตัญญู ซื่อสัตย์ พึ่งพาได้ อดทน เชื่อใจได้ ปากกับใจตรงกัน เป็นคนรักษาคำมั่นสัญญา พอใจในสิ่งที่ตัวเองมี ชอบสะสมสิ่งของ",
      "cons":
          "ช่วยเหลือคนอื่นจนตัวเองเดือดร้อน, ดื้อมาก, เชื่อความคิดตัวเองจะเปลี่ยนความคิดได้ต้องเจอบทเรียนราคาแพง, ความรู้สึกช้า",
    },
    "Yin Earth": {
      "pros":
          "ฉวยโอกาสได้ดี เจอโอกาสเก็บหมด ชอบเก็บสะสมสิ่งของ มีความเมตตา อดทน เข้าใจในความผิดพลาดของคนอื่นๆ สติปัญญาดี อ่อนโยน เข้าใจในโลก ชอบการเปลี่ยนแปลง ชอบของใหม่เบื่อของเก่า",
      "cons":
          "เป็นคนคิดเล็กคิดน้อย เสียสละแค่พอควร ขี้สงสัยหรือตัดสินใจช้า ลังเลเพราะเห็นทุกอย่างเป็นโอกาสหมดอยากเก็บไว้คนเดียว",
    },
    "occupation":
        "งานที่เกี่ยวข้องกับดินหรือการก่อสร้าง เช่น วิศวกรรมโยธา การทำเหมืองแร่ การจัด Landscape, งานที่เกี่ยวกับการประสานงาน เช่น Organizer กรรมการ, งานบัญชี",
  },
  "metal": {
    "Yang Metal": {
      "pros":
          "เป็นคนเด็ดขาด ซื่อตรง แสดงออกชัดเจน มีเหตุผล ยึดถือหลักการ ไม่ยอมเสียเปรียบ ชอบต่อสู้เอาชนะ พูดจาขวานผ่าซาก หงุดหงิดง่าย อดทนต่อความทุกข์เพื่อให้ถึงเป้าหมาย",
      "cons":
          "ขาดความยืดหยุ่นในความคิด ใจเร็ว ด่วนตัดสินใจ ขาดความรอบคอบ รุนแรง",
    },
    "Yin Metal": {
      "pros":
          "ชอบความสวยงาม ความโดดเด่น นุ่มนวล ชอบเป็นจุดสนใจของผู้อื่น มีอารมณ์สุนทรี ตัดสินใจเด็ดขาด อดทน มั่นคง",
      "cons":
          "หูเบา คล้อยตามคนอื่นง่าย ชอบทำให้ตัวเองเป็นจุดเด่นจนอาจจะน่ารำคาญ",
    },
    "occupation":
        "งานที่เกี่ยวข้องกับการจัดการทางการเงิน(ธนาคาร, การซื้อขายหุ้น, โรงรับจำนำ, อัญมณีและของมีค่า), งานที่เกี่ยวข้องกับอำนาจและความถูกต้อง เช่น ทหาร,ทนายความ, การรักษาความปลอดภัย, งานที่เกี่ยวกับโลหะ เช่น เครื่องจักร",
  },
  "water": {
    "Yang Water": {
      "pros":
          "ใจใหญ่ ใจถึง ปรับตัวกับทุกอย่างได้ดี อยู่คนเดียวไม่ได้ ชอบเข้าสังคม เป็นศูนย์รวมของเพื่อนๆ ไม่ชอบทำตามผู้อื่น ทำสิ่งใดก็จะทำให้สำเร็จ คิดอะไรลึกซึ้ง เฉลียวฉลาด ชอบการเปลี่ยนแปลง โกรธง่ายหายเร็ว",
      "cons": "วอกแวกง่าย ไม่เชื่อฟังคนอื่น โลเล มีเล่ห์เหลี่ยมและแผนการมาก",
    },
    "Yin Water": {
      "pros":
          "เป็นคนมีความลึกลับ ไปไหนไม่ค่อยมีคนสนใจ มีน้ำใจ ไม่ชอบแสดงออกให้คนเห็น ชอบศึกษาเรื่องยากๆ คิดอะไรลึกซึ้ง เรียนรู้เร็ว เข้าใจอะไรง่าย อารมณ์อ่อนไหว จินตนาการสูง",
      "cons": "",
    },
    "occupation":
        "ร้านค้าออนไลน์, งานที่เกี่ยวกับน้ำ เช่น การขนส่ง การประมง ร้านซักรีด, งานการท่องเที่ยว เช่น การทูต, สถานเริงรมย์",
  },
};
